tutorials/fluidSolidInteraction/blobInTreacle/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            zeroGradient;
        //type            fixedGradientCorrected;
        //gradient        uniform 0;
    }

    right
    {
        type            fixedValue;
        // type            fixedValueCorrected;
        value           uniform 0;
    }

    up
    {
        type            zeroGradient;
        //type            fixedGradientCorrected;
        //gradient        uniform 0;
    }

    cylinder
    {
        type            zeroGradient;
        //type            fixedGradientCorrected;
        //gradient        uniform 0;
    }

    down
    {
        type            symmetryPlane;
    }

    frontAndBack
    {
        type            empty;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
