tutorials/fluidSolidInteraction/blobInTreacle/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The solid region does not run a standalone PETSc SNES solve in monolithic
// coupling, so no PETSc options are required here.

solvers
{
}

// relaxationFactors
// {
//     equations
//     {
//         //"D|DD"   0.999;
//     }
//     fields
//     {
//         "DD|D" 0.9;
//     }
// }

// ************************************************************************* //
